blog-template/public/dot_product.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-10 Fri 07:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Two Forms of the Dot Product</title>
<meta name="author" content="Gregory Gundersen" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/home/chris/org/test-blog/org/static/style.css"/>

</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
<a href="index.html">Home</a> |
<a href="about.html">About</a> |
<a href="posts-sitemap.html">Blog</a> |
<a href="cpp-notes.html">C++ Notes</a> |
<a href="daily-notes.html">Daily Notes</a>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Two Forms of the Dot Product</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4d5e446">Introduction</a></li>
<li><a href="#orgccc0dba">Algebraic definition</a></li>
<li><a href="#orgc3cc09c">Geometric definition</a></li>
<li><a href="#orgb36841a">Goal</a></li>
<li><a href="#orgcdd64d1">Proof idea</a></li>
<li><a href="#org8aab7d4">Expand the expression</a></li>
<li><a href="#orga2b95f2">Apply the law of cosines</a></li>
<li><a href="#org9719dda">Equate the two expressions</a></li>
<li><a href="#org26b338f">Interpretation</a></li>
<li><a href="#orgdb0e53d">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4d5e446" class="outline-2">
<h2 id="org4d5e446">Introduction</h2>
<div class="outline-text-2" id="text-org4d5e446">
<p>
The dot product is often introduced in two ways:
</p>

<ol class="org-ol">
<li>Algebraic definition</li>
<li>Geometric definition</li>
</ol>

<p>
The goal is to show that these definitions are equivalent.
</p>
</div>
</div>

<div id="outline-container-orgccc0dba" class="outline-2">
<h2 id="orgccc0dba">Algebraic definition</h2>
<div class="outline-text-2" id="text-orgccc0dba">
<p>
Let
</p>

<p>
\[
\mathbf{a} = (a_1, a_2, \dots, a_n)
\]
</p>

<p>
\[
\mathbf{b} = (b_1, b_2, \dots, b_n)
\]
</p>

<p>
The dot product is defined as
</p>

<p>
\[
\mathbf{a} \cdot \mathbf{b} =
\sum_{i=1}^{n} a_i b_i
\]
</p>
</div>
</div>

<div id="outline-container-orgc3cc09c" class="outline-2">
<h2 id="orgc3cc09c">Geometric definition</h2>
<div class="outline-text-2" id="text-orgc3cc09c">
<p>
The dot product can also be written as
</p>

<p>
\[
\mathbf{a} \cdot \mathbf{b} = ||\mathbf{a}|| \, ||\mathbf{b}|| \cos(\theta)
\]
</p>

<p>
where
</p>

<ul class="org-ul">
<li>\(||\mathbf{a}||\) is the magnitude of vector a</li>
<li>\(||\mathbf{b}||\) is the magnitude of vector b</li>
<li>\(\theta\) is the angle between them</li>
</ul>
</div>
</div>

<div id="outline-container-orgb36841a" class="outline-2">
<h2 id="orgb36841a">Goal</h2>
<div class="outline-text-2" id="text-orgb36841a">
<p>
Show that
</p>

<p>
\[
\sum_{i=1}^{n} a_i b_i = ||\mathbf{a}|| \, ||\mathbf{b}|| \cos(\theta)
\]
</p>
</div>
</div>

<div id="outline-container-orgcdd64d1" class="outline-2">
<h2 id="orgcdd64d1">Proof idea</h2>
<div class="outline-text-2" id="text-orgcdd64d1">
<p>
The proof relies on the law of cosines.
</p>

<p>
Consider the vector
</p>

<p>
\[
\mathbf{c} = \mathbf{a} - \mathbf{b}
\]
</p>

<p>
Then
</p>


<p>
\[
(|| \mathbf{c}||) ^2 = (\mathbf{a} - \mathbf{b}) \cdot (\mathbf{a} - \mathbf{b})
\]
</p>
</div>
</div>

<div id="outline-container-org8aab7d4" class="outline-2">
<h2 id="org8aab7d4">Expand the expression</h2>
<div class="outline-text-2" id="text-org8aab7d4">
<p>
Expanding gives
</p>

<p>
\[
(||\mathbf{a}||)^2 + (||\mathbf{b}||)^2 - 2(\mathbf{a} \cdot \mathbf{b})
\]
</p>
</div>
</div>

<div id="outline-container-orga2b95f2" class="outline-2">
<h2 id="orga2b95f2">Apply the law of cosines</h2>
<div class="outline-text-2" id="text-orga2b95f2">
<p>
From geometry,
</p>

<p>
\[ ||\mathbf{c}||^2 =||\mathbf{a}||^2 +||\mathbf{b}||^2-2 ||\mathbf{a}|| ||\mathbf{b}|| \cos(\theta)
\]
</p>
</div>
</div>

<div id="outline-container-org9719dda" class="outline-2">
<h2 id="org9719dda">Equate the two expressions</h2>
<div class="outline-text-2" id="text-org9719dda">
<p>
Comparing the expressions gives
</p>

<p>
\[
\mathbf{a} &sdot; \mathbf{b}
=
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\mathbf{a}</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\mathbf{b}</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">cos(&theta;)</td>
</tr>
</tbody>
</table>
<p>
\]
</p>
</div>
</div>

<div id="outline-container-org26b338f" class="outline-2">
<h2 id="org26b338f">Interpretation</h2>
<div class="outline-text-2" id="text-org26b338f">
<p>
The dot product measures how aligned two vectors are.
</p>

<p>
Special cases:
</p>

<ul class="org-ul">
<li>\(\theta = 0\): vectors aligned → maximum dot product</li>
<li>\(\theta = \pi/2\): orthogonal → dot product = 0</li>
<li>\(\theta = \pi\): opposite directions → negative dot product</li>
</ul>
</div>
</div>

<div id="outline-container-orgdb0e53d" class="outline-2">
<h2 id="orgdb0e53d">Summary</h2>
<div class="outline-text-2" id="text-orgdb0e53d">
<p>
Two equivalent views of the dot product:
</p>

<ol class="org-ol">
<li>Algebraic: sum of component-wise products</li>
<li>Geometric: product of magnitudes scaled by cosine of angle</li>
</ol>

<p>
Both represent the same operation.
</p>
</div>
</div>
</div>
</body>
</html>
